app/controllers/alerts_controller.rb

SELECT "alerts".* FROM "alerts" WHERE "alerts"."user_id" = $1  [["user_id", 1]]
---
  def index
    @user_alerts = Alert.where(user_id: current_user.id)

INSERT INTO "alerts" ("user_id", "target_price", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["target_price", 10000], ["created_at", "2023-06-27 16:57:28.558391"], ["updated_at", "2023-06-27 16:57:28.558391"]]
---
  def create
    payload = {
      user_id: current_user.id,
      target_price: params.dig("alert","target_price")
    }
    @new_alert = Alert.new(payload)
    if @new_alert.save